#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b5eecca9-8296-4e83-87e1-2d3ed2d12889]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf7bdbd6-4d80-448e-964f-8130cdfd46d5]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d30cd9ba-b0ec-40fc-a6c6-3bbc320e82a8]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b68760d9-a7a3-468c-8fec-621d4a79db7f]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e12451ad-c349-4c64-a7e5-aee656739b82]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a5aba6a-e2aa-4430-966e-4ffaab0ff044]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=71fea1dd-088b-4229-beca-942e3b584708]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=7740b461-78eb-4e87-a1c8-a7282721a318]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3d6a8293-b8e5-4f4c-8e68-8e864977850a]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9a9a72df-dc1e-4b03-ab2d-9d0b8f869849]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06881f5a-9a2a-446d-8330-ecc60c3a7c9d]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=eacdc94e-44cc-46b7-afa2-66c49675bd87]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1f3bb449-9862-4f50-92cf-c01e1b1ddcfc]
module.keycloak_test.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=496d3ad4-c1f7-4114-b561-13a3a0ea1df6]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=501b7bca-0bb6-4c47-9117-bf7c198da856]
module.keycloak_test.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a02511e-ee3f-41ab-ab18-879f6a4668b8]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cbf9108a-9276-4c34-8f86-030141ae00d7]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0a76b429-a810-4915-8b34-44c25abb1c83]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=ddcd14b7-3e2d-4b70-9d0f-442f63309f58]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=09d0f991-1b59-452c-80fe-c34bf888feac]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cb0d0e0a-2f5f-408a-88ce-b13f2041dc2a]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bf8b0a6-d38e-4f67-b9c3-6aef0f612503]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=99845905-924d-42a1-b92d-f58d65704507]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a68c05a8-2fd1-4aa8-bccd-0d4dc507bc8e]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=841cd912-503a-4ec1-997c-5e2f14976fbd]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c9f3b0e2-bc88-49c1-9863-3414a2cb4a79]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1ff95228-e145-45bf-8f15-082fae035d22]
module.keycloak_test.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5faab98-04eb-469f-b1a4-bf4c4fbe9478]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e436eaf6-2d97-416e-9822-e74ef85bbee1]
module.keycloak_test.module.onestopauth.module.client_3-test-for-v-1-238.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e13148a3-73d0-4664-b7d6-5da642ea66d4]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2bc87b90-1544-436a-bc43-dc37f3a6068b]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e776b5e8-660d-4a7c-8f93-39ac90ccdc99]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d27d28c5-7397-41d1-a0fc-47408d5661a2]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4b514d83-b2f0-4fa6-8982-6916dd9b5074]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2d0fc15b-01aa-4a92-af75-c34f364a2c99]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0f800bf3-aa76-422b-8100-974c2674c9bf]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2876111d-dbee-4ba2-a08c-6716c2dc8d20]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=08536bb5-70b7-4868-afc5-5a7b0ee2fffe]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=18f2a1a4-d5fc-452e-bebc-281738c5040b]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=72cf5d7b-07b5-4d8c-952f-b28eaa7538a6]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5c626b4-d3f5-4589-ab12-d0b402996ddb]
module.keycloak_test.module.onestopauth.module.client_a-601.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d064814a-bab2-40ae-856d-5328893d8d3d]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6e776ebb-5b9b-442e-9da5-afe794d0d05f]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f5797586-1b16-4abf-85d7-f9a484ead8b1]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f34b44d6-25c2-4083-9e3f-4e2298ab5442]
module.keycloak_test.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=49e70ae0-2b5b-426c-bda7-513bded33489]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=23e19935-0f75-430e-9c3f-45fd9bff3a8c]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=184f6b7b-3bd8-428f-9b40-ecf2fecbeb44]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bc8c23c5-f3bc-4c31-943a-5937638efc39]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=78465122-f8e0-4bd4-8570-b67e62dc1a35]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a5699e37-7e75-4e45-87bd-f20b83d36a07]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d9ff6313-c7b8-4964-a146-23a2d768869f]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=be743407-a68d-4884-8fcd-8e7f001c498a]
module.keycloak_test.module.onestopauth.module.client_project-sso-1189.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=08666c45-3e33-4762-9f16-3e5ecff439ac]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=663db90d-3cb9-44a6-b630-b2263ee923da]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3d40d307-f367-40a9-a948-6d24f1d1eae2]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b7f16c72-655e-4bae-a3f1-adbe94fe32db]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0cd6914f-df94-436f-b89c-e51f5cb29448]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=388101ea-ac10-43f0-88a1-c80f7ae2267d]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=78d9758c-bf06-4fe0-8950-401ae43c2861]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9b6f1b8f-e692-4023-b092-c3bcad8f575a]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=09267776-dbc9-4023-a495-244cf1c5b35d]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d82ffd30-d281-4077-8bca-cb05d8dc37a7]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dfe3d10d-5cab-4b23-8970-8fa455b5a231]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d1ecd95e-f8f4-44b7-8188-dfce9342285b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=625a2b5c-ec5b-4f25-ac04-c423053083bf]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f52e9756-581b-40bd-8f77-a66c3a695407]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8bb345e7-6e26-4ebd-89c4-094fcaa2c684]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=606e17b3-be4f-4cab-8a4d-b70d1a60d0b9]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-prod-test-3400.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=155959da-6fbe-47cf-87bb-4e3dda3c5f5b]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aaf37759-2442-42dd-ab01-db572d096946]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f3734d10-a3df-44b1-9d0e-621b4330c19d]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a1962625-0440-4341-a62a-5e9c2e6ad824]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d24fdc7b-8eac-4609-a1fc-268ad591bd3f]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8c990c1d-afe4-47a6-857c-8cb02401ce4b]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4957b65c-a246-4360-a54e-af73e41ae4e4]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=436f35e7-7a2a-46c6-871c-bbece3c0dc75]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dd63ac12-b9dd-4927-8de0-0265ef050f06]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65e2a1bb-741a-4b83-a313-892b02a074c6]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=83a79b0d-1adc-4a7e-a1d7-5b7514069d7f]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=197aece9-ca97-4c12-b299-9a58f3ddf7c5]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1aa1cd7a-0f72-42f8-8b5c-3c83c0291c19]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=42ed7ce9-97fd-41f5-b1a5-396aaa536b54]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7819dbb4-0632-41c7-8427-8ae1a5a02669]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6e951a28-b605-41b7-ada1-4f3aa70127a0]
module.keycloak_prod.module.onestopauth_basic.module.client_nov-16-3204.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5f181d01-3e6c-4f1a-b0f0-c0e0847b6d66]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8049e9c3-7aa6-4262-9230-b122e805b95c]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=15eabcfa-d28c-42b1-a3d0-72555cda82e5]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=033efda1-8035-4bcf-9288-8d1bad9009b4]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0ec64733-cef3-4245-9602-7e9506e8781c]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ca9c0cf6-3de8-42a7-88da-bb31c7872670]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0288e45e-3df3-48d6-9fa7-1832f90a09a0]
module.keycloak_prod.module.onestopauth_basic.module.client_bceid-with-prod-3104.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=091da1a6-6014-41b4-98ee-c53dfdd246f7]
module.keycloak_prod.module.onestopauth_basic.module.client_test-mappers-3699.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=cfc00ffb-5e23-45d0-8279-da6a444ffc85]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0f521005-8b3e-458d-924d-ac032a340baf]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95136448-40b2-405f-a0f7-2a54b784b98d]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=722e7cb3-109f-4692-8c64-c5903cc51dcd]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fd58d902-a307-4efe-8051-7d66667e1896]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=64f4da34-9368-4cea-b47d-b5f0fd4e277c]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=41430063-49d0-45cd-bc9d-256545fc7800]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8cb41a00-1ca8-45e7-9251-da8615bbc4d0]
module.keycloak_test.module.onestopauth.module.client_2-test-for-v-1-237.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e63d308e-aa95-4341-88bc-b61f9e1735ec]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "jon-junmin-test-01-04-22-4027"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "jon-junmin-test-01-04-22-4027"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_jon-junmin-test-01-04-22-4027.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "jon-junmin-test-01-04-22-4027"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "jon-junmin-test-01-04-22-4027"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-apprval-test-4060"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-apprval-test-4060"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-apprval-test-4060.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-apprval-test-4060"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-apprval-test-4060"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://dev",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3339 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*